app/controllers/admins_controller.rb

SELECT `admins`.* FROM `admins`
---
  def index
    @admins = Admin.all

UPDATE `admins` SET `locked_at` = '2014-06-05 09:56:54', `updated_at` = '2014-06-05 09:56:54', `roles` = '---\n- admin\n' WHERE `admins`.`id` = 2
---
  def lock
    @admin.locked_at = Time.now.utc
    @admin.save

UPDATE `admins` SET `locked_at` = NULL, `updated_at` = '2014-06-10 02:51:32' WHERE `admins`.`id` = 1
---
  def unlock
    @admin.locked_at = nil
    @admin.save

DELETE FROM `admins` WHERE `admins`.`id` = 3
---
  def destroy
    @admin.destroy

SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 3 ORDER BY `admins`.`id` ASC LIMIT 1
---
  def set_admin
    @admin = Admin.find(params[:id])